In [2]:
import os
import pandas as pd
os.listdir('.')

['friend.csv',
 'new_friend.csv',
 'numpy_Practice1.ipynb',
 'pandas_Practice1.ipynb']

In [3]:
# 데이터 폴더 src 변수 할당
base_src = 'D:/공부/python'

# friend.csv 파일 src 변수 할당
friend_src = base_src + '/friend.csv'

In [4]:
# pandas의 read_csv -> 데이터 불러오기
df = pd.read_csv(friend_src, encoding='utf-8')

In [5]:
# head() 데이터를 읽어보기 => 5개만 읽기 -> 괄호 안에 숫자 지정하면 여러 개 읽을 수 있음
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [6]:
new_friend_src = base_src + "/new_friend.csv"

In [7]:
new_friend_src

'D:/공부/python/new_friend.csv'

In [8]:
# index=False 꼭 하기(필요없는 데이터는 안가져오게 하려고)
df.to_csv(new_friend_src,index=False,encoding='utf-8')

In [9]:
os.listdir(base_src)

['friend.csv',
 'new_friend.csv',
 'numpy_Practice1.ipynb',
 'pandas_Practice1.ipynb']

In [10]:
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [11]:
# Series 실습
import numpy as np
np.array([1, 2, 3])

array([1, 2, 3])

In [12]:
# 데이터프레임(집합) => 시리즈(단일) => 데이터프레임
series = df['name']
series

0     John
1    Jenny
2     Nate
3    Julia
4    Brian
5    Chris
Name: name, dtype: object

In [13]:
# pd.Series 함수를 통해서 만드는 것도 가능
series = pd.Series([1, 2, 3, 4])
series

0    1
1    2
2    3
3    4
dtype: int64

In [14]:
# pd.Series의 옵션이 무엇이 있는지 확인
# index => 할당값의 지정 이름, 중복 가능['a','a', 'b', 'c']
# dtype => 대표적 : int, float, string, boolean 등
series = pd.Series([1, 2, 3, 4], index=['a','b', 'c', 'd'], dtype=float)
series

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [15]:
series = pd.Series([10, 2, 5, 4], index=['a','b','c','d'], dtype=float)
series.sort_values(ascending=True) # 오름차순(기본값)

b     2.0
d     4.0
c     5.0
a    10.0
dtype: float64

In [16]:
series.sort_values(ascending=False) # 내림차순

a    10.0
c     5.0
d     4.0
b     2.0
dtype: float64

In [17]:
# DataFrame 실습
df = pd.DataFrame({'a':[2,3], 'b':[5, 10]})
df

   a   b
0  2   5
1  3  10

In [18]:
df = pd.DataFrame([[2, 5], [3, 10], [10, 20]], columns=['a', 'b'])
df

    a   b
0   2   5
1   3  10
2  10  20

In [19]:
# - DataFrame 행, 열 선택 및 필터링
df = pd.read_csv(friend_src, encoding='utf-8')
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [21]:
# index 2번에 해당하는 row 가져오기
# 시리즈 형태
df.iloc[4]

name      Brian
age          45
job     manager
Name: 4, dtype: object

In [22]:
# 데이터프레임 형태로 가져오기
df.iloc[[2]]

   name  age      job
2  Nate   30  teacher

In [23]:
# 컬럼만 보고싶은 경우
df['job']

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [27]:
df.loc[:,'job']

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [25]:
df.iloc[:, 2]

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [37]:
df.index = [0, 1, 2,3,4,5]

In [38]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [30]:
df.iloc[2]

name       Nate
age          30
job     teacher
Name: 3, dtype: object

In [31]:
df.loc[2]

name        Jenny
age            30
job     developer
Name: 2, dtype: object

In [41]:
import numpy as np

In [44]:
# 조건 필터링 가져오기
# 30대 이상만 가져오기
# boolean 형태로 가져옴
df['age']>=30

0    False
1     True
2     True
3     True
4     True
5    False
Name: age, dtype: bool

In [45]:
df[df['age']>=30]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [47]:
# job이 intern인 사람 가져오기
df['job'] == 'intern'

0    False
1    False
2    False
3    False
4    False
5     True
Name: job, dtype: bool

In [48]:
df[df['job'] == 'intern']

    name  age     job
5  Chris   25  intern

In [51]:
# 조건 여러개
# 30대 이상 40대 이하
df[df['age'] >=30 & df['age'] <= 40]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [52]:
df[(df['age'] >=30) & (df['age'] <= 40)]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist

In [53]:
# 조건 여러개
# 30대 미만 혹은 40대 초과
df[(df['age']<30) | (df['age']>40)]

    name  age      job
0   John   20  student
4  Brian   45  manager
5  Chris   25   intern

In [56]:
df['job'].apply(lambda x : x in ['student', 'manager'])

0     True
1    False
2    False
3    False
4     True
5    False
Name: job, dtype: bool

In [54]:
# in을 통한 포함 조건 걸기
df[df['job'].apply(lambda x : x in ['student', 'manager'])]

    name  age      job
0   John   20  student
4  Brian   45  manager